read_liberty -lib /home/miyamii/.ciel/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog -lib /home/miyamii/clownfish_microarchitecture/macros/openram_output/sram_l1_dcache_way.v
read_verilog -sv /home/miyamii/clownfish_microarchitecture/rtl/memory/l1_dcache_new.v
hierarchy -check -top l1_dcache_new
proc
opt
fsm
opt
memory
opt
techmap
opt
dfflibmap -liberty /home/miyamii/.ciel/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
opt_clean -purge
stat -liberty /home/miyamii/.ciel/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
write_verilog -noattr l1_dcache_new_synth.v
