read_liberty -lib /home/miyamii/.ciel/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog -lib /home/miyamii/clownfish_microarchitecture/macros/openram_output/sram_l2_cache_way.v
read_verilog -lib /home/miyamii/clownfish_microarchitecture/macros/openram_output/sram_tlb.v
read_verilog -sv /home/miyamii/clownfish_microarchitecture/rtl/memory/l2_cache_new.v
hierarchy -check -top l2_cache_new
proc
opt
fsm
opt
memory
opt
techmap
opt
dfflibmap -liberty /home/miyamii/.ciel/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
opt_clean -purge
stat -liberty /home/miyamii/.ciel/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
write_verilog -noattr l2_cache_new_synth.v
